In [2]:
import pandas as pd

In [6]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':['abc','def','ghi','xyz'],'col3':[111,222,333,444]})

In [7]:
df

   col1 col2  col3
0     1  abc   111
1     2  def   222
2     3  ghi   333
3     4  xyz   444

In [10]:
df.head()

   col1 col2  col3
0     1  abc   111
1     2  def   222
2     3  ghi   333
3     4  xyz   444

In [12]:
df.tail()

   col1 col2  col3
0     1  abc   111
1     2  def   222
2     3  ghi   333
3     4  xyz   444

In [14]:
df.count()

col1    4
col2    4
col3    4
dtype: int64

In [15]:
df['col2'].count()

4

In [17]:
df['col2'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [20]:
df['col2'].nunique()

4

In [23]:
df['col2'].value_counts()

col2
abc    1
def    1
ghi    1
xyz    1
Name: count, dtype: int64

In [27]:
import numpy as np
df1=pd.DataFrame({'col1':['Charitha',np.nan,'Jnana','Jeevi'],'col2':[1,2,np.nan,4],'col3':['MCA','MBA','MTech',np.nan]})

In [28]:
df1

       col1  col2   col3
0  Charitha   1.0    MCA
1       NaN   2.0    MBA
2     Jnana   NaN  MTech
3     Jeevi   4.0    NaN

In [30]:
df1.dropna()

       col1  col2 col3
0  Charitha   1.0  MCA

In [33]:
del df['col3']

In [34]:
df

   col1
0     1
1     2
2     3
3     4

In [35]:
df1

       col1  col2   col3
0  Charitha   1.0    MCA
1       NaN   2.0    MBA
2     Jnana   NaN  MTech
3     Jeevi   4.0    NaN

In [36]:
df

   col1
0     1
1     2
2     3
3     4

In [39]:
df1.sort_values('col1')

       col1  col2   col3
0  Charitha   1.0    MCA
3     Jeevi   4.0    NaN
2     Jnana   NaN  MTech
1       NaN   2.0    MBA

In [40]:
df1.sort_values(by='col1')

       col1  col2   col3
0  Charitha   1.0    MCA
3     Jeevi   4.0    NaN
2     Jnana   NaN  MTech
1       NaN   2.0    MBA

In [41]:
df1.fillna('FILL')

       col1  col2   col3
0  Charitha   1.0    MCA
1      FILL   2.0    MBA
2     Jnana  FILL  MTech
3     Jeevi   4.0   FILL